app/Answer.php

update `questions` set `answers_count` = `answers_count` - 1, `questions`.`updated_at` = '2020-08-25 10:56:53' where `id` = 46
update `questions` set `answers_count` = `answers_count` - 1, `questions`.`updated_at` = '2020-08-25 10:25:43' where `id` = 48
---
    public static function boot()
    {
        parent::boot();
        static::created(function($answer){
           $answer->question->increment('answers_count');
           $answer->question->save();
        });

        static::deleted(function($answer){
            $answer->question->decrement('answers_count');
        });