app/Question.php

update `questions` set `best_answer_id` = 268, `questions`.`updated_at` = '2020-09-02 15:22:04' where `id` = 52
---
    public function acceptBestAnswer(Answer $answer)
    {
        $this->best_answer_id = $answer->id;
        $this->save();