app/User.php

update `votables` set `vote` = 1 where `user_id` = 3 and `votable_type` = 'App\Question' and `votable_id` in (43)
insert into `votables` (`user_id`, `votable_id`, `votable_type`, `vote`) values (3, 43, 'App\Question', -1)
update `questions` set `votes_count` = 1, `questions`.`updated_at` = '2020-08-27 10:10:21' where `id` = 43
---
    public function voteQuestion(Question $question,$vote)
    {
        $voteQuestions = $this->voteQuestions();
        if ($voteQuestions->where('votable_id',$question->id)->exists()) {
            if ($voteQuestions->where('vote',$vote)->exists()) {
                $voteQuestions->detach($question,['vote'=>$vote]);
            }
            else{
                $voteQuestions->updateExistingPivot($question,['vote'=>$vote]);

            }
        }
        else{
            $voteQuestions->attach($question,['vote'=>$vote]);
        }

        $question->load('votes');
        $downVotes = (int) $question->downVotes()->sum('vote');
        $upVotes = (int) $question->upVotes()->sum('vote');
        $question->votes_count = $upVotes + $downVotes;
        $question->save();

update `answers` set `votes_count` = -2, `answers`.`updated_at` = '2020-08-27 14:32:40' where `id` = 206
update `votables` set `vote` = -1 where `user_id` = 3 and `votable_type` = 'App\Answer' and `votable_id` in (208)
insert into `votables` (`user_id`, `votable_id`, `votable_type`, `vote`) values (3, 206, 'App\Answer', 1)
update `answers` set `votes_count` = -1, `answers`.`updated_at` = '2020-08-27 10:38:14' where `id` = 208
---
    public function voteAnswer(Answer $answer, $vote)
    {
         $voteAnswers = $this->voteAnswers();
        if ($voteAnswers->where('votable_id',$answer->id)->exists()) {
            if ($voteAnswers->where('vote',$vote)->exists()) {
                $voteAnswers->detach($answer,['vote'=>$vote]);
            }
            else{
                $voteAnswers->updateExistingPivot($answer,['vote'=>$vote]);

            }
        }
        else{
            $voteAnswers->attach($answer,['vote'=>$vote]);
        }

        $answer->load('votes');
        $downVotes = (int) $answer->downVotes()->sum('vote');
        $upVotes = (int) $answer->upVotes()->sum('vote');
        $answer->votes_count = $upVotes + $downVotes;
        $answer->save();