app/Http/Controllers/AnswersController.php

    public function update(Request $request,Question $question, Answer $answer)
    {
        $this->authorize('update',$answer);
        $answer->update($request->validate([
            'body'=>'required',
        ]));
---
update `answers` set `body` = 'rdgfhjkl;\' Updated', `answers`.`updated_at` = '2020-09-11 13:50:49' where `id` = 294