app/Http/Controllers/AnswersController.php

    public function update(Request $request,Question $question, Answer $answer)
    {
        $this->authorize('update',$answer);
        $answer->update($request->validate([
            'body'=>'required',
        ]));
---
update `answers` set `body` = 'dgfhjklm;,./ update', `answers`.`updated_at` = '2020-08-31 16:01:24' where `id` = 277

    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete',$answer);
        $answer->delete();
---
delete from `answers` where `id` = 286