app/Http/Controllers/FavoritesController.php

insert into `favorites` (`created_at`, `question_id`, `updated_at`, `user_id`) values ('2020-09-04 11:43:15', 45, '2020-09-04 11:43:15', 9)
---
    public function store(Question $question)
    {
        $question->favorites()->attach(auth::id());