app/Http/Controllers/QuestionController.php

select * from `questions` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `questions`
---
    public function index()
    {
        $questions = Question::latest()->paginate(10);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-09-02 16:29:07' where `id` = 52
---
    public function show(Question $question)
    {
        $question->increment('views');

update `questions` set `title` = 'Quia odit esse consequuntur dolore Updated!!', `slug` = 'quia-odit-esse-consequuntur-dolore-updated', `questions`.`updated_at` = '2020-09-11 12:16:30' where `id` = 45
---
    public function update(AskQuestionRequest $request, Question $question)
    {
        $this->authorize("update", $question);

        $question->update($request->only('title','body'));