app/Http/Controllers/QuestionController.php

delete from `questions` where `id` = 45
---
    public function destroy(Question $question)
    {
        $question->delete();