app/Providers/RouteServiceProvider.php

    public function boot()
    {
        Route::bind('slug', function($slug) {
            return Question::with(['user','answers.user'])->where('slug', $slug)->first() ?? abort(404);
---
select * from `answers` where `answers`.`question_id` in (43)
select * from `questions` where `slug` = 'doloremque-natus-vel-at-eum-inventore-maiores-officia-ea' limit 1
select * from `users` where `users`.`id` in (10)